# Based on:
# https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/
# https://danielmiessler.com/blog/first-10-things-new-mac/
# https://hackercodex.com/guide/python-development-environment-on-mac-osx/
# See homebrew-bundle:
# https://github.com/Homebrew/homebrew-bundle
# Make macOS more linux-y
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'gzip'
brew 'watch'
brew 'tmux'
brew 'wget'
brew 'nmap'
brew 'gpg'
brew 'htop'
brew 'podman'
brew 'neovim'
brew 'fzf'
brew 'diff-so-fancy'
brew 'lsd'
brew 'fortune'
brew 'cowsay'
brew 'zsh'
brew 'antidote'
brew 'direnv'
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build'
brew 'starship'
brew 'just'

# LSP servers
brew 'pyright'
brew 'gopls'
brew 'bash-language-server'
brew 'typescript-language-server'
brew 'solargraph'
